UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32g47x_pinmux.h
/* Do not edit!
 * Generated from /devel/cubemx/db/mcu/IPGPIO-STM32G47x_gpio_v1_0_Modes.xml*/

#if !defined(_STM32G47x_PINMUX_H_)
# define _STM32G47x_PINMUX_H_

#define COMP1_OUT_FUNC           0
#define COMP2_OUT_FUNC           1
#define COMP3_OUT_FUNC           2
#define COMP4_OUT_FUNC           3
#define COMP5_OUT_FUNC           4
#define COMP6_OUT_FUNC           5
#define COMP7_OUT_FUNC           6
#define CRS_SYNC_FUNC            7
#define EVENTOUT_FUNC            8
#define FDCAN1_RX_FUNC           9
#define FDCAN1_TX_FUNC           10
#define FDCAN2_RX_FUNC           11
#define FDCAN2_TX_FUNC           12
#define FDCAN3_RX_FUNC           13
#define FDCAN3_TX_FUNC           14
#define FMC_A0_FUNC              15
#define FMC_A1_FUNC              16
#define FMC_A10_FUNC             17
#define FMC_A11_FUNC             18
#define FMC_A12_FUNC             19
#define FMC_A13_FUNC             20
#define FMC_A14_FUNC             21
#define FMC_A15_FUNC             22
#define FMC_A16_FUNC             23
#define FMC_A17_FUNC             24
#define FMC_A18_FUNC             25
#define FMC_A19_FUNC             26
#define FMC_A2_FUNC              27
#define FMC_A20_FUNC             28
#define FMC_A21_FUNC             29
#define FMC_A22_FUNC             30
#define FMC_A23_FUNC             31
#define FMC_A24_FUNC             32
#define FMC_A25_FUNC             33
#define FMC_A3_FUNC              34
#define FMC_A4_FUNC              35
#define FMC_A5_FUNC              36
#define FMC_A6_FUNC              37
#define FMC_A7_FUNC              38
#define FMC_A8_FUNC              39
#define FMC_A9_FUNC              40
#define FMC_CLK_FUNC             41
#define FMC_D0_FUNC              42
#define FMC_D1_FUNC              43
#define FMC_D10_FUNC             44
#define FMC_D11_FUNC             45
#define FMC_D12_FUNC             46
#define FMC_D13_FUNC             47
#define FMC_D14_FUNC             48
#define FMC_D15_FUNC             49
#define FMC_D2_FUNC              50
#define FMC_D3_FUNC              51
#define FMC_D4_FUNC              52
#define FMC_D5_FUNC              53
#define FMC_D6_FUNC              54
#define FMC_D7_FUNC              55
#define FMC_D8_FUNC              56
#define FMC_D9_FUNC              57
#define FMC_DA0_FUNC             58
#define FMC_DA1_FUNC             59
#define FMC_DA10_FUNC            60
#define FMC_DA11_FUNC            61
#define FMC_DA12_FUNC            62
#define FMC_DA13_FUNC            63
#define FMC_DA14_FUNC            64
#define FMC_DA15_FUNC            65
#define FMC_DA2_FUNC             66
#define FMC_DA3_FUNC             67
#define FMC_DA4_FUNC             68
#define FMC_DA5_FUNC             69
#define FMC_DA6_FUNC             70
#define FMC_DA7_FUNC             71
#define FMC_DA8_FUNC             72
#define FMC_DA9_FUNC             73
#define FMC_INT_FUNC             74
#define FMC_NBL0_FUNC            75
#define FMC_NBL1_FUNC            76
#define FMC_NCE_FUNC             77
#define FMC_NE1_FUNC             78
#define FMC_NE2_FUNC             79
#define FMC_NE3_FUNC             80
#define FMC_NE4_FUNC             81
#define FMC_NL_FUNC              82
#define FMC_NOE_FUNC             83
#define FMC_NWAIT_FUNC           84
#define FMC_NWE_FUNC             85
#define HRTIM1_CHA1_FUNC         86
#define HRTIM1_CHA2_FUNC         87
#define HRTIM1_CHB1_FUNC         88
#define HRTIM1_CHB2_FUNC         89
#define HRTIM1_CHC1_FUNC         90
#define HRTIM1_CHC2_FUNC         91
#define HRTIM1_CHD1_FUNC         92
#define HRTIM1_CHD2_FUNC         93
#define HRTIM1_CHE1_FUNC         94
#define HRTIM1_CHE2_FUNC         95
#define HRTIM1_CHF1_FUNC         96
#define HRTIM1_CHF2_FUNC         97
#define HRTIM1_EEV1_FUNC         98
#define HRTIM1_EEV10_FUNC        99
#define HRTIM1_EEV2_FUNC         100
#define HRTIM1_EEV3_FUNC         101
#define HRTIM1_EEV4_FUNC         102
#define HRTIM1_EEV5_FUNC         103
#define HRTIM1_EEV6_FUNC         104
#define HRTIM1_EEV7_FUNC         105
#define HRTIM1_EEV8_FUNC         106
#define HRTIM1_EEV9_FUNC         107
#define HRTIM1_FLT1_FUNC         108
#define HRTIM1_FLT2_FUNC         109
#define HRTIM1_FLT3_FUNC         110
#define HRTIM1_FLT4_FUNC         111
#define HRTIM1_FLT5_FUNC         112
#define HRTIM1_FLT6_FUNC         113
#define HRTIM1_SCIN_FUNC         114
#define HRTIM1_SCOUT_FUNC        115
#define I2C1_SCL_FUNC            116
#define I2C1_SDA_FUNC            117
#define I2C1_SMBA_FUNC           118
#define I2C2_SCL_FUNC            119
#define I2C2_SDA_FUNC            120
#define I2C2_SMBA_FUNC           121
#define I2C3_SCL_FUNC            122
#define I2C3_SDA_FUNC            123
#define I2C3_SMBA_FUNC           124
#define I2C4_SCL_FUNC            125
#define I2C4_SDA_FUNC            126
#define I2C4_SMBA_FUNC           127
#define I2S2_CK_FUNC             128
#define I2S2_MCK_FUNC            129
#define I2S2_SD_FUNC             130
#define I2S2_WS_FUNC             131
#define I2S3_CK_FUNC             132
#define I2S3_MCK_FUNC            133
#define I2S3_SD_FUNC             134
#define I2S3_WS_FUNC             135
#define I2S_CKIN_FUNC            136
#define IR_OUT_FUNC              137
#define LPTIM1_ETR_FUNC          138
#define LPTIM1_IN1_FUNC          139
#define LPTIM1_IN2_FUNC          140
#define LPTIM1_OUT_FUNC          141
#define LPUART1_CTS_FUNC         142
#define LPUART1_DE_FUNC          143
#define LPUART1_RTS_FUNC         144
#define LPUART1_RX_FUNC          145
#define LPUART1_TX_FUNC          146
#define QUADSPI1_BK1_IO0_FUNC    147
#define QUADSPI1_BK1_IO1_FUNC    148
#define QUADSPI1_BK1_IO2_FUNC    149
#define QUADSPI1_BK1_IO3_FUNC    150
#define QUADSPI1_BK1_NCS_FUNC    151
#define QUADSPI1_BK2_IO0_FUNC    152
#define QUADSPI1_BK2_IO1_FUNC    153
#define QUADSPI1_BK2_IO2_FUNC    154
#define QUADSPI1_BK2_IO3_FUNC    155
#define QUADSPI1_BK2_NCS_FUNC    156
#define QUADSPI1_CLK_FUNC        157
#define RCC_MCO_FUNC             158
#define RTC_OUT2_FUNC            159
#define RTC_REFIN_FUNC           160
#define SAI1_CK1_FUNC            161
#define SAI1_CK2_FUNC            162
#define SAI1_D1_FUNC             163
#define SAI1_D2_FUNC             164
#define SAI1_D3_FUNC             165
#define SAI1_FS_A_FUNC           166
#define SAI1_FS_B_FUNC           167
#define SAI1_MCLK_A_FUNC         168
#define SAI1_MCLK_B_FUNC         169
#define SAI1_SCK_A_FUNC          170
#define SAI1_SCK_B_FUNC          171
#define SAI1_SD_A_FUNC           172
#define SAI1_SD_B_FUNC           173
#define SPI1_MISO_FUNC           174
#define SPI1_MOSI_FUNC           175
#define SPI1_NSS_FUNC            176
#define SPI1_SCK_FUNC            177
#define SPI2_MISO_FUNC           178
#define SPI2_MOSI_FUNC           179
#define SPI2_NSS_FUNC            180
#define SPI2_SCK_FUNC            181
#define SPI3_MISO_FUNC           182
#define SPI3_MOSI_FUNC           183
#define SPI3_NSS_FUNC            184
#define SPI3_SCK_FUNC            185
#define SPI4_MISO_FUNC           186
#define SPI4_MOSI_FUNC           187
#define SPI4_NSS_FUNC            188
#define SPI4_SCK_FUNC            189
#define SYS_JTCK_SWCLK_FUNC      190
#define SYS_JTDI_FUNC            191
#define SYS_JTDO_SWO_FUNC        192
#define SYS_JTMS_SWDIO_FUNC      193
#define SYS_JTRST_FUNC           194
#define SYS_SLEEP_FUNC           195
#define SYS_TRACECLK_FUNC        196
#define SYS_TRACED0_FUNC         197
#define SYS_TRACED1_FUNC         198
#define SYS_TRACED2_FUNC         199
#define SYS_TRACED3_FUNC         200
#define TIM15_BKIN_FUNC          201
#define TIM15_CH1_FUNC           202
#define TIM15_CH1N_FUNC          203
#define TIM15_CH2_FUNC           204
#define TIM16_BKIN_FUNC          205
#define TIM16_CH1_FUNC           206
#define TIM16_CH1N_FUNC          207
#define TIM17_BKIN_FUNC          208
#define TIM17_CH1_FUNC           209
#define TIM17_CH1N_FUNC          210
#define TIM1_BKIN_FUNC           211
#define TIM1_BKIN2_FUNC          212
#define TIM1_CH1_FUNC            213
#define TIM1_CH1N_FUNC           214
#define TIM1_CH2_FUNC            215
#define TIM1_CH2N_FUNC           216
#define TIM1_CH3_FUNC            217
#define TIM1_CH3N_FUNC           218
#define TIM1_CH4_FUNC            219
#define TIM1_CH4N_FUNC           220
#define TIM1_ETR_FUNC            221
#define TIM20_BKIN_FUNC          222
#define TIM20_BKIN2_FUNC         223
#define TIM20_CH1_FUNC           224
#define TIM20_CH1N_FUNC          225
#define TIM20_CH2_FUNC           226
#define TIM20_CH2N_FUNC          227
#define TIM20_CH3_FUNC           228
#define TIM20_CH3N_FUNC          229
#define TIM20_CH4_FUNC           230
#define TIM20_CH4N_FUNC          231
#define TIM20_ETR_FUNC           232
#define TIM2_CH1_FUNC            233
#define TIM2_CH2_FUNC            234
#define TIM2_CH3_FUNC            235
#define TIM2_CH4_FUNC            236
#define TIM2_ETR_FUNC            237
#define TIM3_CH1_FUNC            238
#define TIM3_CH2_FUNC            239
#define TIM3_CH3_FUNC            240
#define TIM3_CH4_FUNC            241
#define TIM3_ETR_FUNC            242
#define TIM4_CH1_FUNC            243
#define TIM4_CH2_FUNC            244
#define TIM4_CH3_FUNC            245
#define TIM4_CH4_FUNC            246
#define TIM4_ETR_FUNC            247
#define TIM5_CH1_FUNC            248
#define TIM5_CH2_FUNC            249
#define TIM5_CH3_FUNC            250
#define TIM5_CH4_FUNC            251
#define TIM5_ETR_FUNC            252
#define TIM8_BKIN_FUNC           253
#define TIM8_BKIN2_FUNC          254
#define TIM8_CH1_FUNC            255
#define TIM8_CH1N_FUNC           256
#define TIM8_CH2_FUNC            257
#define TIM8_CH2N_FUNC           258
#define TIM8_CH3_FUNC            259
#define TIM8_CH3N_FUNC           260
#define TIM8_CH4_FUNC            261
#define TIM8_CH4N_FUNC           262
#define TIM8_ETR_FUNC            263
#define UART4_CTS_FUNC           264
#define UART4_DE_FUNC            265
#define UART4_RTS_FUNC           266
#define UART4_RX_FUNC            267
#define UART4_TX_FUNC            268
#define UART5_CTS_FUNC           269
#define UART5_DE_FUNC            270
#define UART5_RTS_FUNC           271
#define UART5_RX_FUNC            272
#define UART5_TX_FUNC            273
#define UCPD1_FRSTX1_FUNC        274
#define UCPD1_FRSTX2_FUNC        275
#define USART1_CK_FUNC           276
#define UART1_CK_FUNC            276
#define USART1_CTS_FUNC          277
#define UART1_CTS_FUNC           277
#define USART1_DE_FUNC           278
#define UART1_DE_FUNC            278
#define USART1_NSS_FUNC          279
#define UART1_NSS_FUNC           279
#define USART1_RTS_FUNC          280
#define UART1_RTS_FUNC           280
#define USART1_RX_FUNC           281
#define UART1_RX_FUNC            281
#define USART1_TX_FUNC           282
#define UART1_TX_FUNC            282
#define USART2_CK_FUNC           283
#define UART2_CK_FUNC            283
#define USART2_CTS_FUNC          284
#define UART2_CTS_FUNC           284
#define USART2_DE_FUNC           285
#define UART2_DE_FUNC            285
#define USART2_NSS_FUNC          286
#define UART2_NSS_FUNC           286
#define USART2_RTS_FUNC          287
#define UART2_RTS_FUNC           287
#define USART2_RX_FUNC           288
#define UART2_RX_FUNC            288
#define USART2_TX_FUNC           289
#define UART2_TX_FUNC            289
#define USART3_CK_FUNC           290
#define UART3_CK_FUNC            290
#define USART3_CTS_FUNC          291
#define UART3_CTS_FUNC           291
#define USART3_DE_FUNC           292
#define UART3_DE_FUNC            292
#define USART3_NSS_FUNC          293
#define UART3_NSS_FUNC           293
#define USART3_RTS_FUNC          294
#define UART3_RTS_FUNC           294
#define USART3_RX_FUNC           295
#define UART3_RX_FUNC            295
#define USART3_TX_FUNC           296
#define UART3_TX_FUNC            296

