UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32g47x_pinmux.h
# define PINMUX(gpio, func) ((gpio == PIN_NONE) ? AF_PIN_NONE : 	\
	((gpio == PA00) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PA00) && (func == TIM5_CH1_FUNC            )) ?  2 : \
	((gpio == PA00) && (func == USART2_CTS_FUNC          )) ?  7 : \
	((gpio == PA00) && (func == USART2_NSS_FUNC          )) ?  7 : \
	((gpio == PA00) && (func == COMP1_OUT_FUNC           )) ?  8 : \
	((gpio == PA00) && (func == TIM8_BKIN_FUNC           )) ?  9 : \
	((gpio == PA00) && (func == TIM8_ETR_FUNC            )) ? 10 : \
	((gpio == PA00) && (func == TIM2_ETR_FUNC            )) ? 14 : \
	((gpio == PA00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA01) && (func == RTC_REFIN_FUNC           )) ?  0 : \
	((gpio == PA01) && (func == TIM2_CH2_FUNC            )) ?  1 : \
	((gpio == PA01) && (func == TIM5_CH2_FUNC            )) ?  2 : \
	((gpio == PA01) && (func == USART2_DE_FUNC           )) ?  7 : \
	((gpio == PA01) && (func == USART2_RTS_FUNC          )) ?  7 : \
	((gpio == PA01) && (func == TIM15_CH1N_FUNC          )) ?  9 : \
	((gpio == PA01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA02) && (func == TIM2_CH3_FUNC            )) ?  1 : \
	((gpio == PA02) && (func == TIM5_CH3_FUNC            )) ?  2 : \
	((gpio == PA02) && (func == USART2_TX_FUNC           )) ?  7 : \
	((gpio == PA02) && (func == COMP2_OUT_FUNC           )) ?  8 : \
	((gpio == PA02) && (func == TIM15_CH1_FUNC           )) ?  9 : \
	((gpio == PA02) && (func == QUADSPI1_BK1_NCS_FUNC    )) ? 10 : \
	((gpio == PA02) && (func == LPUART1_TX_FUNC          )) ? 12 : \
	((gpio == PA02) && (func == UCPD1_FRSTX1_FUNC        )) ? 14 : \
	((gpio == PA02) && (func == UCPD1_FRSTX2_FUNC        )) ? 14 : \
	((gpio == PA02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA03) && (func == TIM2_CH4_FUNC            )) ?  1 : \
	((gpio == PA03) && (func == TIM5_CH4_FUNC            )) ?  2 : \
	((gpio == PA03) && (func == SAI1_CK1_FUNC            )) ?  3 : \
	((gpio == PA03) && (func == USART2_RX_FUNC           )) ?  7 : \
	((gpio == PA03) && (func == TIM15_CH2_FUNC           )) ?  9 : \
	((gpio == PA03) && (func == QUADSPI1_CLK_FUNC        )) ? 10 : \
	((gpio == PA03) && (func == LPUART1_RX_FUNC          )) ? 12 : \
	((gpio == PA03) && (func == SAI1_MCLK_A_FUNC         )) ? 13 : \
	((gpio == PA03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA04) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PA04) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PA04) && (func == I2S3_WS_FUNC             )) ?  6 : \
	((gpio == PA04) && (func == SPI3_NSS_FUNC            )) ?  6 : \
	((gpio == PA04) && (func == USART2_CK_FUNC           )) ?  7 : \
	((gpio == PA04) && (func == SAI1_FS_B_FUNC           )) ? 13 : \
	((gpio == PA04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA05) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PA05) && (func == TIM2_ETR_FUNC            )) ?  2 : \
	((gpio == PA05) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PA05) && (func == UCPD1_FRSTX1_FUNC        )) ? 14 : \
	((gpio == PA05) && (func == UCPD1_FRSTX2_FUNC        )) ? 14 : \
	((gpio == PA05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA06) && (func == TIM16_CH1_FUNC           )) ?  1 : \
	((gpio == PA06) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PA06) && (func == TIM8_BKIN_FUNC           )) ?  4 : \
	((gpio == PA06) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PA06) && (func == TIM1_BKIN_FUNC           )) ?  6 : \
	((gpio == PA06) && (func == COMP1_OUT_FUNC           )) ?  8 : \
	((gpio == PA06) && (func == QUADSPI1_BK1_IO3_FUNC    )) ? 10 : \
	((gpio == PA06) && (func == LPUART1_CTS_FUNC         )) ? 12 : \
	((gpio == PA06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA07) && (func == TIM17_CH1_FUNC           )) ?  1 : \
	((gpio == PA07) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PA07) && (func == TIM8_CH1N_FUNC           )) ?  4 : \
	((gpio == PA07) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PA07) && (func == TIM1_CH1N_FUNC           )) ?  6 : \
	((gpio == PA07) && (func == COMP2_OUT_FUNC           )) ?  8 : \
	((gpio == PA07) && (func == QUADSPI1_BK1_IO2_FUNC    )) ? 10 : \
	((gpio == PA07) && (func == UCPD1_FRSTX1_FUNC        )) ? 14 : \
	((gpio == PA07) && (func == UCPD1_FRSTX2_FUNC        )) ? 14 : \
	((gpio == PA07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA08) && (func == RCC_MCO_FUNC             )) ?  0 : \
	((gpio == PA08) && (func == I2C3_SCL_FUNC            )) ?  2 : \
	((gpio == PA08) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PA08) && (func == I2S2_MCK_FUNC            )) ?  5 : \
	((gpio == PA08) && (func == TIM1_CH1_FUNC            )) ?  6 : \
	((gpio == PA08) && (func == USART1_CK_FUNC           )) ?  7 : \
	((gpio == PA08) && (func == COMP7_OUT_FUNC           )) ?  8 : \
	((gpio == PA08) && (func == TIM4_ETR_FUNC            )) ? 10 : \
	((gpio == PA08) && (func == FDCAN3_RX_FUNC           )) ? 11 : \
	((gpio == PA08) && (func == SAI1_CK2_FUNC            )) ? 12 : \
	((gpio == PA08) && (func == HRTIM1_CHA1_FUNC         )) ? 13 : \
	((gpio == PA08) && (func == SAI1_SCK_A_FUNC          )) ? 14 : \
	((gpio == PA08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA09) && (func == I2C3_SMBA_FUNC           )) ?  2 : \
	((gpio == PA09) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PA09) && (func == I2S3_MCK_FUNC            )) ?  5 : \
	((gpio == PA09) && (func == TIM1_CH2_FUNC            )) ?  6 : \
	((gpio == PA09) && (func == USART1_TX_FUNC           )) ?  7 : \
	((gpio == PA09) && (func == COMP5_OUT_FUNC           )) ?  8 : \
	((gpio == PA09) && (func == TIM15_BKIN_FUNC          )) ?  9 : \
	((gpio == PA09) && (func == TIM2_CH3_FUNC            )) ? 10 : \
	((gpio == PA09) && (func == HRTIM1_CHA2_FUNC         )) ? 13 : \
	((gpio == PA09) && (func == SAI1_FS_A_FUNC           )) ? 14 : \
	((gpio == PA09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA10) && (func == TIM17_BKIN_FUNC          )) ?  1 : \
	((gpio == PA10) && (func == CRS_SYNC_FUNC            )) ?  3 : \
	((gpio == PA10) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PA10) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PA10) && (func == TIM1_CH3_FUNC            )) ?  6 : \
	((gpio == PA10) && (func == USART1_RX_FUNC           )) ?  7 : \
	((gpio == PA10) && (func == COMP6_OUT_FUNC           )) ?  8 : \
	((gpio == PA10) && (func == TIM2_CH4_FUNC            )) ? 10 : \
	((gpio == PA10) && (func == TIM8_BKIN_FUNC           )) ? 11 : \
	((gpio == PA10) && (func == SAI1_D1_FUNC             )) ? 12 : \
	((gpio == PA10) && (func == HRTIM1_CHB1_FUNC         )) ? 13 : \
	((gpio == PA10) && (func == SAI1_SD_A_FUNC           )) ? 14 : \
	((gpio == PA10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA11) && (func == I2S2_SD_FUNC             )) ?  5 : \
	((gpio == PA11) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PA11) && (func == TIM1_CH1N_FUNC           )) ?  6 : \
	((gpio == PA11) && (func == USART1_CTS_FUNC          )) ?  7 : \
	((gpio == PA11) && (func == USART1_NSS_FUNC          )) ?  7 : \
	((gpio == PA11) && (func == COMP1_OUT_FUNC           )) ?  8 : \
	((gpio == PA11) && (func == FDCAN1_RX_FUNC           )) ?  9 : \
	((gpio == PA11) && (func == TIM4_CH1_FUNC            )) ? 10 : \
	((gpio == PA11) && (func == TIM1_CH4_FUNC            )) ? 11 : \
	((gpio == PA11) && (func == TIM1_BKIN2_FUNC          )) ? 12 : \
	((gpio == PA11) && (func == HRTIM1_CHB2_FUNC         )) ? 13 : \
	((gpio == PA11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA12) && (func == TIM16_CH1_FUNC           )) ?  1 : \
	((gpio == PA12) && (func == I2S_CKIN_FUNC            )) ?  5 : \
	((gpio == PA12) && (func == TIM1_CH2N_FUNC           )) ?  6 : \
	((gpio == PA12) && (func == USART1_DE_FUNC           )) ?  7 : \
	((gpio == PA12) && (func == USART1_RTS_FUNC          )) ?  7 : \
	((gpio == PA12) && (func == COMP2_OUT_FUNC           )) ?  8 : \
	((gpio == PA12) && (func == FDCAN1_TX_FUNC           )) ?  9 : \
	((gpio == PA12) && (func == TIM4_CH2_FUNC            )) ? 10 : \
	((gpio == PA12) && (func == TIM1_ETR_FUNC            )) ? 11 : \
	((gpio == PA12) && (func == HRTIM1_FLT1_FUNC         )) ? 13 : \
	((gpio == PA12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA13) && (func == SYS_JTMS_SWDIO_FUNC      )) ?  0 : \
	((gpio == PA13) && (func == TIM16_CH1N_FUNC          )) ?  1 : \
	((gpio == PA13) && (func == I2C4_SCL_FUNC            )) ?  3 : \
	((gpio == PA13) && (func == I2C1_SCL_FUNC            )) ?  4 : \
	((gpio == PA13) && (func == IR_OUT_FUNC              )) ?  5 : \
	((gpio == PA13) && (func == USART3_CTS_FUNC          )) ?  7 : \
	((gpio == PA13) && (func == USART3_NSS_FUNC          )) ?  7 : \
	((gpio == PA13) && (func == TIM4_CH3_FUNC            )) ? 10 : \
	((gpio == PA13) && (func == SAI1_SD_B_FUNC           )) ? 13 : \
	((gpio == PA13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA14) && (func == SYS_JTCK_SWCLK_FUNC      )) ?  0 : \
	((gpio == PA14) && (func == LPTIM1_OUT_FUNC          )) ?  1 : \
	((gpio == PA14) && (func == I2C4_SMBA_FUNC           )) ?  3 : \
	((gpio == PA14) && (func == I2C1_SDA_FUNC            )) ?  4 : \
	((gpio == PA14) && (func == TIM8_CH2_FUNC            )) ?  5 : \
	((gpio == PA14) && (func == TIM1_BKIN_FUNC           )) ?  6 : \
	((gpio == PA14) && (func == USART2_TX_FUNC           )) ?  7 : \
	((gpio == PA14) && (func == SAI1_FS_B_FUNC           )) ? 13 : \
	((gpio == PA14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA15) && (func == SYS_JTDI_FUNC            )) ?  0 : \
	((gpio == PA15) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PA15) && (func == TIM8_CH1_FUNC            )) ?  2 : \
	((gpio == PA15) && (func == I2C1_SCL_FUNC            )) ?  4 : \
	((gpio == PA15) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PA15) && (func == I2S3_WS_FUNC             )) ?  6 : \
	((gpio == PA15) && (func == SPI3_NSS_FUNC            )) ?  6 : \
	((gpio == PA15) && (func == USART2_RX_FUNC           )) ?  7 : \
	((gpio == PA15) && (func == UART4_DE_FUNC            )) ?  8 : \
	((gpio == PA15) && (func == UART4_RTS_FUNC           )) ?  8 : \
	((gpio == PA15) && (func == TIM1_BKIN_FUNC           )) ?  9 : \
	((gpio == PA15) && (func == FDCAN3_TX_FUNC           )) ? 11 : \
	((gpio == PA15) && (func == HRTIM1_FLT2_FUNC         )) ? 13 : \
	((gpio == PA15) && (func == TIM2_ETR_FUNC            )) ? 14 : \
	((gpio == PA15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB00) && (func == TIM3_CH3_FUNC            )) ?  2 : \
	((gpio == PB00) && (func == TIM8_CH2N_FUNC           )) ?  4 : \
	((gpio == PB00) && (func == TIM1_CH2N_FUNC           )) ?  6 : \
	((gpio == PB00) && (func == QUADSPI1_BK1_IO1_FUNC    )) ? 10 : \
	((gpio == PB00) && (func == HRTIM1_FLT5_FUNC         )) ? 13 : \
	((gpio == PB00) && (func == UCPD1_FRSTX1_FUNC        )) ? 14 : \
	((gpio == PB00) && (func == UCPD1_FRSTX2_FUNC        )) ? 14 : \
	((gpio == PB00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB01) && (func == TIM3_CH4_FUNC            )) ?  2 : \
	((gpio == PB01) && (func == TIM8_CH3N_FUNC           )) ?  4 : \
	((gpio == PB01) && (func == TIM1_CH3N_FUNC           )) ?  6 : \
	((gpio == PB01) && (func == COMP4_OUT_FUNC           )) ?  8 : \
	((gpio == PB01) && (func == QUADSPI1_BK1_IO0_FUNC    )) ? 10 : \
	((gpio == PB01) && (func == LPUART1_DE_FUNC          )) ? 12 : \
	((gpio == PB01) && (func == LPUART1_RTS_FUNC         )) ? 12 : \
	((gpio == PB01) && (func == HRTIM1_SCOUT_FUNC        )) ? 13 : \
	((gpio == PB01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB02) && (func == RTC_OUT2_FUNC            )) ?  0 : \
	((gpio == PB02) && (func == LPTIM1_OUT_FUNC          )) ?  1 : \
	((gpio == PB02) && (func == TIM5_CH1_FUNC            )) ?  2 : \
	((gpio == PB02) && (func == TIM20_CH1_FUNC           )) ?  3 : \
	((gpio == PB02) && (func == I2C3_SMBA_FUNC           )) ?  4 : \
	((gpio == PB02) && (func == QUADSPI1_BK2_IO1_FUNC    )) ? 10 : \
	((gpio == PB02) && (func == HRTIM1_SCIN_FUNC         )) ? 13 : \
	((gpio == PB02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB03) && (func == SYS_JTDO_SWO_FUNC        )) ?  0 : \
	((gpio == PB03) && (func == TIM2_CH2_FUNC            )) ?  1 : \
	((gpio == PB03) && (func == TIM4_ETR_FUNC            )) ?  2 : \
	((gpio == PB03) && (func == CRS_SYNC_FUNC            )) ?  3 : \
	((gpio == PB03) && (func == TIM8_CH1N_FUNC           )) ?  4 : \
	((gpio == PB03) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PB03) && (func == I2S3_CK_FUNC             )) ?  6 : \
	((gpio == PB03) && (func == SPI3_SCK_FUNC            )) ?  6 : \
	((gpio == PB03) && (func == USART2_TX_FUNC           )) ?  7 : \
	((gpio == PB03) && (func == TIM3_ETR_FUNC            )) ? 10 : \
	((gpio == PB03) && (func == FDCAN3_RX_FUNC           )) ? 11 : \
	((gpio == PB03) && (func == HRTIM1_SCOUT_FUNC        )) ? 12 : \
	((gpio == PB03) && (func == HRTIM1_EEV9_FUNC         )) ? 13 : \
	((gpio == PB03) && (func == SAI1_SCK_B_FUNC          )) ? 14 : \
	((gpio == PB03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB04) && (func == SYS_JTRST_FUNC           )) ?  0 : \
	((gpio == PB04) && (func == TIM16_CH1_FUNC           )) ?  1 : \
	((gpio == PB04) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PB04) && (func == TIM8_CH2N_FUNC           )) ?  4 : \
	((gpio == PB04) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PB04) && (func == SPI3_MISO_FUNC           )) ?  6 : \
	((gpio == PB04) && (func == USART2_RX_FUNC           )) ?  7 : \
	((gpio == PB04) && (func == UART5_DE_FUNC            )) ?  8 : \
	((gpio == PB04) && (func == UART5_RTS_FUNC           )) ?  8 : \
	((gpio == PB04) && (func == TIM17_BKIN_FUNC          )) ? 10 : \
	((gpio == PB04) && (func == FDCAN3_TX_FUNC           )) ? 11 : \
	((gpio == PB04) && (func == HRTIM1_EEV7_FUNC         )) ? 13 : \
	((gpio == PB04) && (func == SAI1_MCLK_B_FUNC         )) ? 14 : \
	((gpio == PB04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB05) && (func == TIM16_BKIN_FUNC          )) ?  1 : \
	((gpio == PB05) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PB05) && (func == TIM8_CH3N_FUNC           )) ?  3 : \
	((gpio == PB05) && (func == I2C1_SMBA_FUNC           )) ?  4 : \
	((gpio == PB05) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PB05) && (func == I2S3_SD_FUNC             )) ?  6 : \
	((gpio == PB05) && (func == SPI3_MOSI_FUNC           )) ?  6 : \
	((gpio == PB05) && (func == USART2_CK_FUNC           )) ?  7 : \
	((gpio == PB05) && (func == I2C3_SDA_FUNC            )) ?  8 : \
	((gpio == PB05) && (func == FDCAN2_RX_FUNC           )) ?  9 : \
	((gpio == PB05) && (func == TIM17_CH1_FUNC           )) ? 10 : \
	((gpio == PB05) && (func == LPTIM1_IN1_FUNC          )) ? 11 : \
	((gpio == PB05) && (func == SAI1_SD_B_FUNC           )) ? 12 : \
	((gpio == PB05) && (func == HRTIM1_EEV6_FUNC         )) ? 13 : \
	((gpio == PB05) && (func == UART5_CTS_FUNC           )) ? 14 : \
	((gpio == PB05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB06) && (func == TIM16_CH1N_FUNC          )) ?  1 : \
	((gpio == PB06) && (func == TIM4_CH1_FUNC            )) ?  2 : \
	((gpio == PB06) && (func == TIM8_CH1_FUNC            )) ?  5 : \
	((gpio == PB06) && (func == TIM8_ETR_FUNC            )) ?  6 : \
	((gpio == PB06) && (func == USART1_TX_FUNC           )) ?  7 : \
	((gpio == PB06) && (func == COMP4_OUT_FUNC           )) ?  8 : \
	((gpio == PB06) && (func == FDCAN2_TX_FUNC           )) ?  9 : \
	((gpio == PB06) && (func == TIM8_BKIN2_FUNC          )) ? 10 : \
	((gpio == PB06) && (func == LPTIM1_ETR_FUNC          )) ? 11 : \
	((gpio == PB06) && (func == HRTIM1_SCIN_FUNC         )) ? 12 : \
	((gpio == PB06) && (func == HRTIM1_EEV4_FUNC         )) ? 13 : \
	((gpio == PB06) && (func == SAI1_FS_B_FUNC           )) ? 14 : \
	((gpio == PB06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB07) && (func == TIM17_CH1N_FUNC          )) ?  1 : \
	((gpio == PB07) && (func == TIM4_CH2_FUNC            )) ?  2 : \
	((gpio == PB07) && (func == I2C4_SDA_FUNC            )) ?  3 : \
	((gpio == PB07) && (func == I2C1_SDA_FUNC            )) ?  4 : \
	((gpio == PB07) && (func == TIM8_BKIN_FUNC           )) ?  5 : \
	((gpio == PB07) && (func == USART1_RX_FUNC           )) ?  7 : \
	((gpio == PB07) && (func == COMP3_OUT_FUNC           )) ?  8 : \
	((gpio == PB07) && (func == TIM3_CH4_FUNC            )) ? 10 : \
	((gpio == PB07) && (func == LPTIM1_IN2_FUNC          )) ? 11 : \
	((gpio == PB07) && (func == FMC_NL_FUNC              )) ? 12 : \
	((gpio == PB07) && (func == HRTIM1_EEV3_FUNC         )) ? 13 : \
	((gpio == PB07) && (func == UART4_CTS_FUNC           )) ? 14 : \
	((gpio == PB07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB08) && (func == TIM16_CH1_FUNC           )) ?  1 : \
	((gpio == PB08) && (func == TIM4_CH3_FUNC            )) ?  2 : \
	((gpio == PB08) && (func == SAI1_CK1_FUNC            )) ?  3 : \
	((gpio == PB08) && (func == I2C1_SCL_FUNC            )) ?  4 : \
	((gpio == PB08) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PB08) && (func == COMP1_OUT_FUNC           )) ?  8 : \
	((gpio == PB08) && (func == FDCAN1_RX_FUNC           )) ?  9 : \
	((gpio == PB08) && (func == TIM8_CH2_FUNC            )) ? 10 : \
	((gpio == PB08) && (func == TIM1_BKIN_FUNC           )) ? 12 : \
	((gpio == PB08) && (func == HRTIM1_EEV8_FUNC         )) ? 13 : \
	((gpio == PB08) && (func == SAI1_MCLK_A_FUNC         )) ? 14 : \
	((gpio == PB08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB09) && (func == TIM17_CH1_FUNC           )) ?  1 : \
	((gpio == PB09) && (func == TIM4_CH4_FUNC            )) ?  2 : \
	((gpio == PB09) && (func == SAI1_D2_FUNC             )) ?  3 : \
	((gpio == PB09) && (func == I2C1_SDA_FUNC            )) ?  4 : \
	((gpio == PB09) && (func == IR_OUT_FUNC              )) ?  6 : \
	((gpio == PB09) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PB09) && (func == COMP2_OUT_FUNC           )) ?  8 : \
	((gpio == PB09) && (func == FDCAN1_TX_FUNC           )) ?  9 : \
	((gpio == PB09) && (func == TIM8_CH3_FUNC            )) ? 10 : \
	((gpio == PB09) && (func == TIM1_CH3N_FUNC           )) ? 12 : \
	((gpio == PB09) && (func == HRTIM1_EEV5_FUNC         )) ? 13 : \
	((gpio == PB09) && (func == SAI1_FS_A_FUNC           )) ? 14 : \
	((gpio == PB09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB10) && (func == TIM2_CH3_FUNC            )) ?  1 : \
	((gpio == PB10) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PB10) && (func == LPUART1_RX_FUNC          )) ?  8 : \
	((gpio == PB10) && (func == QUADSPI1_CLK_FUNC        )) ? 10 : \
	((gpio == PB10) && (func == TIM1_BKIN_FUNC           )) ? 12 : \
	((gpio == PB10) && (func == HRTIM1_FLT3_FUNC         )) ? 13 : \
	((gpio == PB10) && (func == SAI1_SCK_A_FUNC          )) ? 14 : \
	((gpio == PB10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB11) && (func == TIM2_CH4_FUNC            )) ?  1 : \
	((gpio == PB11) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PB11) && (func == LPUART1_TX_FUNC          )) ?  8 : \
	((gpio == PB11) && (func == QUADSPI1_BK1_NCS_FUNC    )) ? 10 : \
	((gpio == PB11) && (func == HRTIM1_FLT4_FUNC         )) ? 13 : \
	((gpio == PB11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB12) && (func == TIM5_ETR_FUNC            )) ?  2 : \
	((gpio == PB12) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PB12) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PB12) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PB12) && (func == TIM1_BKIN_FUNC           )) ?  6 : \
	((gpio == PB12) && (func == USART3_CK_FUNC           )) ?  7 : \
	((gpio == PB12) && (func == LPUART1_DE_FUNC          )) ?  8 : \
	((gpio == PB12) && (func == LPUART1_RTS_FUNC         )) ?  8 : \
	((gpio == PB12) && (func == FDCAN2_RX_FUNC           )) ?  9 : \
	((gpio == PB12) && (func == HRTIM1_CHC1_FUNC         )) ? 13 : \
	((gpio == PB12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB13) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PB13) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PB13) && (func == TIM1_CH1N_FUNC           )) ?  6 : \
	((gpio == PB13) && (func == USART3_CTS_FUNC          )) ?  7 : \
	((gpio == PB13) && (func == USART3_NSS_FUNC          )) ?  7 : \
	((gpio == PB13) && (func == LPUART1_CTS_FUNC         )) ?  8 : \
	((gpio == PB13) && (func == FDCAN2_TX_FUNC           )) ?  9 : \
	((gpio == PB13) && (func == HRTIM1_CHC2_FUNC         )) ? 13 : \
	((gpio == PB13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB14) && (func == TIM15_CH1_FUNC           )) ?  1 : \
	((gpio == PB14) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PB14) && (func == TIM1_CH2N_FUNC           )) ?  6 : \
	((gpio == PB14) && (func == USART3_DE_FUNC           )) ?  7 : \
	((gpio == PB14) && (func == USART3_RTS_FUNC          )) ?  7 : \
	((gpio == PB14) && (func == COMP4_OUT_FUNC           )) ?  8 : \
	((gpio == PB14) && (func == HRTIM1_CHD1_FUNC         )) ? 13 : \
	((gpio == PB14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB15) && (func == RTC_REFIN_FUNC           )) ?  0 : \
	((gpio == PB15) && (func == TIM15_CH2_FUNC           )) ?  1 : \
	((gpio == PB15) && (func == TIM15_CH1N_FUNC          )) ?  2 : \
	((gpio == PB15) && (func == COMP3_OUT_FUNC           )) ?  3 : \
	((gpio == PB15) && (func == TIM1_CH3N_FUNC           )) ?  4 : \
	((gpio == PB15) && (func == I2S2_SD_FUNC             )) ?  5 : \
	((gpio == PB15) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PB15) && (func == HRTIM1_CHD2_FUNC         )) ? 13 : \
	((gpio == PB15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC00) && (func == LPTIM1_IN1_FUNC          )) ?  1 : \
	((gpio == PC00) && (func == TIM1_CH1_FUNC            )) ?  2 : \
	((gpio == PC00) && (func == LPUART1_RX_FUNC          )) ?  8 : \
	((gpio == PC00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC01) && (func == LPTIM1_OUT_FUNC          )) ?  1 : \
	((gpio == PC01) && (func == TIM1_CH2_FUNC            )) ?  2 : \
	((gpio == PC01) && (func == LPUART1_TX_FUNC          )) ?  8 : \
	((gpio == PC01) && (func == QUADSPI1_BK2_IO0_FUNC    )) ? 10 : \
	((gpio == PC01) && (func == SAI1_SD_A_FUNC           )) ? 13 : \
	((gpio == PC01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC02) && (func == LPTIM1_IN2_FUNC          )) ?  1 : \
	((gpio == PC02) && (func == TIM1_CH3_FUNC            )) ?  2 : \
	((gpio == PC02) && (func == COMP3_OUT_FUNC           )) ?  3 : \
	((gpio == PC02) && (func == TIM20_CH2_FUNC           )) ?  6 : \
	((gpio == PC02) && (func == QUADSPI1_BK2_IO1_FUNC    )) ? 10 : \
	((gpio == PC02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC03) && (func == SYS_SLEEP_FUNC           )) ?  0 : \
	((gpio == PC03) && (func == LPTIM1_ETR_FUNC          )) ?  1 : \
	((gpio == PC03) && (func == TIM1_CH4_FUNC            )) ?  2 : \
	((gpio == PC03) && (func == SAI1_D1_FUNC             )) ?  3 : \
	((gpio == PC03) && (func == TIM1_BKIN2_FUNC          )) ?  6 : \
	((gpio == PC03) && (func == QUADSPI1_BK2_IO2_FUNC    )) ? 10 : \
	((gpio == PC03) && (func == SAI1_SD_A_FUNC           )) ? 13 : \
	((gpio == PC03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC04) && (func == TIM1_ETR_FUNC            )) ?  2 : \
	((gpio == PC04) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PC04) && (func == USART1_TX_FUNC           )) ?  7 : \
	((gpio == PC04) && (func == QUADSPI1_BK2_IO3_FUNC    )) ? 10 : \
	((gpio == PC04) && (func == EVENTOUT_FUNC            )) ? 15 : \
