UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32g47x_pinmux.h
	((gpio == PC05) && (func == TIM15_BKIN_FUNC          )) ?  2 : \
	((gpio == PC05) && (func == SAI1_D3_FUNC             )) ?  3 : \
	((gpio == PC05) && (func == TIM1_CH4N_FUNC           )) ?  6 : \
	((gpio == PC05) && (func == USART1_RX_FUNC           )) ?  7 : \
	((gpio == PC05) && (func == HRTIM1_EEV10_FUNC        )) ? 13 : \
	((gpio == PC05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC06) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PC06) && (func == HRTIM1_EEV10_FUNC        )) ?  3 : \
	((gpio == PC06) && (func == TIM8_CH1_FUNC            )) ?  4 : \
	((gpio == PC06) && (func == I2S2_MCK_FUNC            )) ?  6 : \
	((gpio == PC06) && (func == COMP6_OUT_FUNC           )) ?  7 : \
	((gpio == PC06) && (func == I2C4_SCL_FUNC            )) ?  8 : \
	((gpio == PC06) && (func == HRTIM1_CHF1_FUNC         )) ? 13 : \
	((gpio == PC06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC07) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PC07) && (func == HRTIM1_FLT5_FUNC         )) ?  3 : \
	((gpio == PC07) && (func == TIM8_CH2_FUNC            )) ?  4 : \
	((gpio == PC07) && (func == I2S3_MCK_FUNC            )) ?  6 : \
	((gpio == PC07) && (func == COMP5_OUT_FUNC           )) ?  7 : \
	((gpio == PC07) && (func == I2C4_SDA_FUNC            )) ?  8 : \
	((gpio == PC07) && (func == HRTIM1_CHF2_FUNC         )) ? 13 : \
	((gpio == PC07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC08) && (func == TIM3_CH3_FUNC            )) ?  2 : \
	((gpio == PC08) && (func == HRTIM1_CHE1_FUNC         )) ?  3 : \
	((gpio == PC08) && (func == TIM8_CH3_FUNC            )) ?  4 : \
	((gpio == PC08) && (func == TIM20_CH3_FUNC           )) ?  6 : \
	((gpio == PC08) && (func == COMP7_OUT_FUNC           )) ?  7 : \
	((gpio == PC08) && (func == I2C3_SCL_FUNC            )) ?  8 : \
	((gpio == PC08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC09) && (func == TIM3_CH4_FUNC            )) ?  2 : \
	((gpio == PC09) && (func == HRTIM1_CHE2_FUNC         )) ?  3 : \
	((gpio == PC09) && (func == TIM8_CH4_FUNC            )) ?  4 : \
	((gpio == PC09) && (func == I2S_CKIN_FUNC            )) ?  5 : \
	((gpio == PC09) && (func == TIM8_BKIN2_FUNC          )) ?  6 : \
	((gpio == PC09) && (func == I2C3_SDA_FUNC            )) ?  8 : \
	((gpio == PC09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC10) && (func == TIM8_CH1N_FUNC           )) ?  4 : \
	((gpio == PC10) && (func == UART4_TX_FUNC            )) ?  5 : \
	((gpio == PC10) && (func == I2S3_CK_FUNC             )) ?  6 : \
	((gpio == PC10) && (func == SPI3_SCK_FUNC            )) ?  6 : \
	((gpio == PC10) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PC10) && (func == HRTIM1_FLT6_FUNC         )) ? 13 : \
	((gpio == PC10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC11) && (func == HRTIM1_EEV2_FUNC         )) ?  3 : \
	((gpio == PC11) && (func == TIM8_CH2N_FUNC           )) ?  4 : \
	((gpio == PC11) && (func == UART4_RX_FUNC            )) ?  5 : \
	((gpio == PC11) && (func == SPI3_MISO_FUNC           )) ?  6 : \
	((gpio == PC11) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PC11) && (func == I2C3_SDA_FUNC            )) ?  8 : \
	((gpio == PC11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC12) && (func == TIM5_CH2_FUNC            )) ?  1 : \
	((gpio == PC12) && (func == HRTIM1_EEV1_FUNC         )) ?  3 : \
	((gpio == PC12) && (func == TIM8_CH3N_FUNC           )) ?  4 : \
	((gpio == PC12) && (func == UART5_TX_FUNC            )) ?  5 : \
	((gpio == PC12) && (func == I2S3_SD_FUNC             )) ?  6 : \
	((gpio == PC12) && (func == SPI3_MOSI_FUNC           )) ?  6 : \
	((gpio == PC12) && (func == USART3_CK_FUNC           )) ?  7 : \
	((gpio == PC12) && (func == UCPD1_FRSTX1_FUNC        )) ? 14 : \
	((gpio == PC12) && (func == UCPD1_FRSTX2_FUNC        )) ? 14 : \
	((gpio == PC12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC13) && (func == TIM1_BKIN_FUNC           )) ?  2 : \
	((gpio == PC13) && (func == TIM1_CH1N_FUNC           )) ?  4 : \
	((gpio == PC13) && (func == TIM8_CH4N_FUNC           )) ?  6 : \
	((gpio == PC13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD00) && (func == TIM8_CH4N_FUNC           )) ?  6 : \
	((gpio == PD00) && (func == FDCAN1_RX_FUNC           )) ?  9 : \
	((gpio == PD00) && (func == FMC_D2_FUNC              )) ? 12 : \
	((gpio == PD00) && (func == FMC_DA2_FUNC             )) ? 12 : \
	((gpio == PD00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD01) && (func == TIM8_CH4_FUNC            )) ?  4 : \
	((gpio == PD01) && (func == TIM8_BKIN2_FUNC          )) ?  6 : \
	((gpio == PD01) && (func == FDCAN1_TX_FUNC           )) ?  9 : \
	((gpio == PD01) && (func == FMC_D3_FUNC              )) ? 12 : \
	((gpio == PD01) && (func == FMC_DA3_FUNC             )) ? 12 : \
	((gpio == PD01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD02) && (func == TIM3_ETR_FUNC            )) ?  2 : \
	((gpio == PD02) && (func == TIM8_BKIN_FUNC           )) ?  4 : \
	((gpio == PD02) && (func == UART5_RX_FUNC            )) ?  5 : \
	((gpio == PD02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD03) && (func == TIM2_CH1_FUNC            )) ?  2 : \
	((gpio == PD03) && (func == TIM2_ETR_FUNC            )) ?  2 : \
	((gpio == PD03) && (func == USART2_CTS_FUNC          )) ?  7 : \
	((gpio == PD03) && (func == USART2_NSS_FUNC          )) ?  7 : \
	((gpio == PD03) && (func == QUADSPI1_BK2_NCS_FUNC    )) ? 10 : \
	((gpio == PD03) && (func == FMC_CLK_FUNC             )) ? 12 : \
	((gpio == PD03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD04) && (func == TIM2_CH2_FUNC            )) ?  2 : \
	((gpio == PD04) && (func == USART2_DE_FUNC           )) ?  7 : \
	((gpio == PD04) && (func == USART2_RTS_FUNC          )) ?  7 : \
	((gpio == PD04) && (func == QUADSPI1_BK2_IO0_FUNC    )) ? 10 : \
	((gpio == PD04) && (func == FMC_NOE_FUNC             )) ? 12 : \
	((gpio == PD04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD05) && (func == USART2_TX_FUNC           )) ?  7 : \
	((gpio == PD05) && (func == QUADSPI1_BK2_IO1_FUNC    )) ? 10 : \
	((gpio == PD05) && (func == FMC_NWE_FUNC             )) ? 12 : \
	((gpio == PD05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD06) && (func == TIM2_CH4_FUNC            )) ?  2 : \
	((gpio == PD06) && (func == SAI1_D1_FUNC             )) ?  3 : \
	((gpio == PD06) && (func == USART2_RX_FUNC           )) ?  7 : \
	((gpio == PD06) && (func == QUADSPI1_BK2_IO2_FUNC    )) ? 10 : \
	((gpio == PD06) && (func == FMC_NWAIT_FUNC           )) ? 12 : \
	((gpio == PD06) && (func == SAI1_SD_A_FUNC           )) ? 13 : \
	((gpio == PD06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD07) && (func == TIM2_CH3_FUNC            )) ?  2 : \
	((gpio == PD07) && (func == USART2_CK_FUNC           )) ?  7 : \
	((gpio == PD07) && (func == QUADSPI1_BK2_IO3_FUNC    )) ? 10 : \
	((gpio == PD07) && (func == FMC_NCE_FUNC             )) ? 12 : \
	((gpio == PD07) && (func == FMC_NE1_FUNC             )) ? 12 : \
	((gpio == PD07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD08) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PD08) && (func == FMC_D13_FUNC             )) ? 12 : \
	((gpio == PD08) && (func == FMC_DA13_FUNC            )) ? 12 : \
	((gpio == PD08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD09) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PD09) && (func == FMC_D14_FUNC             )) ? 12 : \
	((gpio == PD09) && (func == FMC_DA14_FUNC            )) ? 12 : \
	((gpio == PD09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD10) && (func == USART3_CK_FUNC           )) ?  7 : \
	((gpio == PD10) && (func == FMC_D15_FUNC             )) ? 12 : \
	((gpio == PD10) && (func == FMC_DA15_FUNC            )) ? 12 : \
	((gpio == PD10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD11) && (func == TIM5_ETR_FUNC            )) ?  1 : \
	((gpio == PD11) && (func == I2C4_SMBA_FUNC           )) ?  4 : \
	((gpio == PD11) && (func == USART3_CTS_FUNC          )) ?  7 : \
	((gpio == PD11) && (func == USART3_NSS_FUNC          )) ?  7 : \
	((gpio == PD11) && (func == FMC_A16_FUNC             )) ? 12 : \
	((gpio == PD11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD12) && (func == TIM4_CH1_FUNC            )) ?  2 : \
	((gpio == PD12) && (func == USART3_DE_FUNC           )) ?  7 : \
	((gpio == PD12) && (func == USART3_RTS_FUNC          )) ?  7 : \
	((gpio == PD12) && (func == FMC_A17_FUNC             )) ? 12 : \
	((gpio == PD12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD13) && (func == TIM4_CH2_FUNC            )) ?  2 : \
	((gpio == PD13) && (func == FMC_A18_FUNC             )) ? 12 : \
	((gpio == PD13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD14) && (func == TIM4_CH3_FUNC            )) ?  2 : \
	((gpio == PD14) && (func == FMC_D0_FUNC              )) ? 12 : \
	((gpio == PD14) && (func == FMC_DA0_FUNC             )) ? 12 : \
	((gpio == PD14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD15) && (func == TIM4_CH4_FUNC            )) ?  2 : \
	((gpio == PD15) && (func == SPI2_NSS_FUNC            )) ?  6 : \
	((gpio == PD15) && (func == FMC_D1_FUNC              )) ? 12 : \
	((gpio == PD15) && (func == FMC_DA1_FUNC             )) ? 12 : \
	((gpio == PD15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE00) && (func == TIM4_ETR_FUNC            )) ?  2 : \
	((gpio == PE00) && (func == TIM20_CH4N_FUNC          )) ?  3 : \
	((gpio == PE00) && (func == TIM16_CH1_FUNC           )) ?  4 : \
	((gpio == PE00) && (func == TIM20_ETR_FUNC           )) ?  6 : \
	((gpio == PE00) && (func == USART1_TX_FUNC           )) ?  7 : \
	((gpio == PE00) && (func == FMC_NBL0_FUNC            )) ? 12 : \
	((gpio == PE00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE01) && (func == TIM17_CH1_FUNC           )) ?  4 : \
	((gpio == PE01) && (func == TIM20_CH4_FUNC           )) ?  6 : \
	((gpio == PE01) && (func == USART1_RX_FUNC           )) ?  7 : \
	((gpio == PE01) && (func == FMC_NBL1_FUNC            )) ? 12 : \
	((gpio == PE01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE02) && (func == SYS_TRACECLK_FUNC        )) ?  0 : \
	((gpio == PE02) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PE02) && (func == SAI1_CK1_FUNC            )) ?  3 : \
	((gpio == PE02) && (func == SPI4_SCK_FUNC            )) ?  5 : \
	((gpio == PE02) && (func == TIM20_CH1_FUNC           )) ?  6 : \
	((gpio == PE02) && (func == FMC_A23_FUNC             )) ? 12 : \
	((gpio == PE02) && (func == SAI1_MCLK_A_FUNC         )) ? 13 : \
	((gpio == PE02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE03) && (func == SYS_TRACED0_FUNC         )) ?  0 : \
	((gpio == PE03) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PE03) && (func == SPI4_NSS_FUNC            )) ?  5 : \
	((gpio == PE03) && (func == TIM20_CH2_FUNC           )) ?  6 : \
	((gpio == PE03) && (func == FMC_A19_FUNC             )) ? 12 : \
	((gpio == PE03) && (func == SAI1_SD_B_FUNC           )) ? 13 : \
	((gpio == PE03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE04) && (func == SYS_TRACED1_FUNC         )) ?  0 : \
	((gpio == PE04) && (func == TIM3_CH3_FUNC            )) ?  2 : \
	((gpio == PE04) && (func == SAI1_D2_FUNC             )) ?  3 : \
	((gpio == PE04) && (func == SPI4_NSS_FUNC            )) ?  5 : \
	((gpio == PE04) && (func == TIM20_CH1N_FUNC          )) ?  6 : \
	((gpio == PE04) && (func == FMC_A20_FUNC             )) ? 12 : \
	((gpio == PE04) && (func == SAI1_FS_A_FUNC           )) ? 13 : \
	((gpio == PE04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE05) && (func == SYS_TRACED2_FUNC         )) ?  0 : \
	((gpio == PE05) && (func == TIM3_CH4_FUNC            )) ?  2 : \
	((gpio == PE05) && (func == SAI1_CK2_FUNC            )) ?  3 : \
	((gpio == PE05) && (func == SPI4_MISO_FUNC           )) ?  5 : \
	((gpio == PE05) && (func == TIM20_CH2N_FUNC          )) ?  6 : \
	((gpio == PE05) && (func == FMC_A21_FUNC             )) ? 12 : \
	((gpio == PE05) && (func == SAI1_SCK_A_FUNC          )) ? 13 : \
	((gpio == PE05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE06) && (func == SYS_TRACED3_FUNC         )) ?  0 : \
	((gpio == PE06) && (func == SAI1_D1_FUNC             )) ?  3 : \
	((gpio == PE06) && (func == SPI4_MOSI_FUNC           )) ?  5 : \
	((gpio == PE06) && (func == TIM20_CH3N_FUNC          )) ?  6 : \
	((gpio == PE06) && (func == FMC_A22_FUNC             )) ? 12 : \
	((gpio == PE06) && (func == SAI1_SD_A_FUNC           )) ? 13 : \
	((gpio == PE06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE07) && (func == TIM1_ETR_FUNC            )) ?  2 : \
	((gpio == PE07) && (func == FMC_D4_FUNC              )) ? 12 : \
	((gpio == PE07) && (func == FMC_DA4_FUNC             )) ? 12 : \
	((gpio == PE07) && (func == SAI1_SD_B_FUNC           )) ? 13 : \
	((gpio == PE07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE08) && (func == TIM5_CH3_FUNC            )) ?  1 : \
	((gpio == PE08) && (func == TIM1_CH1N_FUNC           )) ?  2 : \
	((gpio == PE08) && (func == FMC_D5_FUNC              )) ? 12 : \
	((gpio == PE08) && (func == FMC_DA5_FUNC             )) ? 12 : \
	((gpio == PE08) && (func == SAI1_SCK_B_FUNC          )) ? 13 : \
	((gpio == PE08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE09) && (func == TIM5_CH4_FUNC            )) ?  1 : \
	((gpio == PE09) && (func == TIM1_CH1_FUNC            )) ?  2 : \
	((gpio == PE09) && (func == FMC_D6_FUNC              )) ? 12 : \
	((gpio == PE09) && (func == FMC_DA6_FUNC             )) ? 12 : \
	((gpio == PE09) && (func == SAI1_FS_B_FUNC           )) ? 13 : \
	((gpio == PE09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE10) && (func == TIM1_CH2N_FUNC           )) ?  2 : \
	((gpio == PE10) && (func == QUADSPI1_CLK_FUNC        )) ? 10 : \
	((gpio == PE10) && (func == FMC_D7_FUNC              )) ? 12 : \
	((gpio == PE10) && (func == FMC_DA7_FUNC             )) ? 12 : \
	((gpio == PE10) && (func == SAI1_MCLK_B_FUNC         )) ? 13 : \
	((gpio == PE10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE11) && (func == TIM1_CH2_FUNC            )) ?  2 : \
	((gpio == PE11) && (func == SPI4_NSS_FUNC            )) ?  5 : \
	((gpio == PE11) && (func == QUADSPI1_BK1_NCS_FUNC    )) ? 10 : \
	((gpio == PE11) && (func == FMC_D8_FUNC              )) ? 12 : \
	((gpio == PE11) && (func == FMC_DA8_FUNC             )) ? 12 : \
	((gpio == PE11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE12) && (func == TIM1_CH3N_FUNC           )) ?  2 : \
	((gpio == PE12) && (func == SPI4_SCK_FUNC            )) ?  5 : \
	((gpio == PE12) && (func == QUADSPI1_BK1_IO0_FUNC    )) ? 10 : \
	((gpio == PE12) && (func == FMC_D9_FUNC              )) ? 12 : \
	((gpio == PE12) && (func == FMC_DA9_FUNC             )) ? 12 : \
	((gpio == PE12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE13) && (func == TIM1_CH3_FUNC            )) ?  2 : \
	((gpio == PE13) && (func == SPI4_MISO_FUNC           )) ?  5 : \
	((gpio == PE13) && (func == QUADSPI1_BK1_IO1_FUNC    )) ? 10 : \
	((gpio == PE13) && (func == FMC_D10_FUNC             )) ? 12 : \
	((gpio == PE13) && (func == FMC_DA10_FUNC            )) ? 12 : \
	((gpio == PE13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE14) && (func == TIM1_CH4_FUNC            )) ?  2 : \
	((gpio == PE14) && (func == SPI4_MOSI_FUNC           )) ?  5 : \
	((gpio == PE14) && (func == TIM1_BKIN2_FUNC          )) ?  6 : \
	((gpio == PE14) && (func == QUADSPI1_BK1_IO2_FUNC    )) ? 10 : \
	((gpio == PE14) && (func == FMC_D11_FUNC             )) ? 12 : \
	((gpio == PE14) && (func == FMC_DA11_FUNC            )) ? 12 : \
	((gpio == PE14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE15) && (func == TIM1_BKIN_FUNC           )) ?  2 : \
	((gpio == PE15) && (func == TIM1_CH4N_FUNC           )) ?  6 : \
	((gpio == PE15) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PE15) && (func == QUADSPI1_BK1_IO3_FUNC    )) ? 10 : \
	((gpio == PE15) && (func == FMC_D12_FUNC             )) ? 12 : \
	((gpio == PE15) && (func == FMC_DA12_FUNC            )) ? 12 : \
	((gpio == PE15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF00) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PF00) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PF00) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PF00) && (func == TIM1_CH3N_FUNC           )) ?  6 : \
	((gpio == PF00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF01) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PF01) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PF01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF02) && (func == TIM20_CH3_FUNC           )) ?  2 : \
	((gpio == PF02) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PF02) && (func == FMC_A2_FUNC              )) ? 12 : \
	((gpio == PF02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF03) && (func == TIM20_CH4_FUNC           )) ?  2 : \
	((gpio == PF03) && (func == I2C3_SCL_FUNC            )) ?  4 : \
	((gpio == PF03) && (func == FMC_A3_FUNC              )) ? 12 : \
	((gpio == PF03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF04) && (func == COMP1_OUT_FUNC           )) ?  2 : \
	((gpio == PF04) && (func == TIM20_CH1N_FUNC          )) ?  3 : \
	((gpio == PF04) && (func == I2C3_SDA_FUNC            )) ?  4 : \
	((gpio == PF04) && (func == FMC_A4_FUNC              )) ? 12 : \
	((gpio == PF04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF05) && (func == TIM20_CH2N_FUNC          )) ?  2 : \
	((gpio == PF05) && (func == FMC_A5_FUNC              )) ? 12 : \
	((gpio == PF05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF06) && (func == TIM5_ETR_FUNC            )) ?  1 : \
	((gpio == PF06) && (func == TIM4_CH4_FUNC            )) ?  2 : \
	((gpio == PF06) && (func == SAI1_SD_B_FUNC           )) ?  3 : \
	((gpio == PF06) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PF06) && (func == TIM5_CH1_FUNC            )) ?  6 : \
	((gpio == PF06) && (func == USART3_DE_FUNC           )) ?  7 : \
	((gpio == PF06) && (func == USART3_RTS_FUNC          )) ?  7 : \
	((gpio == PF06) && (func == QUADSPI1_BK1_IO3_FUNC    )) ? 10 : \
	((gpio == PF06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF07) && (func == TIM20_BKIN_FUNC          )) ?  2 : \
	((gpio == PF07) && (func == TIM5_CH2_FUNC            )) ?  6 : \
	((gpio == PF07) && (func == QUADSPI1_BK1_IO2_FUNC    )) ? 10 : \
	((gpio == PF07) && (func == FMC_A1_FUNC              )) ? 12 : \
	((gpio == PF07) && (func == SAI1_MCLK_B_FUNC         )) ? 13 : \
	((gpio == PF07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF08) && (func == TIM20_BKIN2_FUNC         )) ?  2 : \
	((gpio == PF08) && (func == TIM5_CH3_FUNC            )) ?  6 : \
	((gpio == PF08) && (func == QUADSPI1_BK1_IO0_FUNC    )) ? 10 : \
	((gpio == PF08) && (func == FMC_A24_FUNC             )) ? 12 : \
	((gpio == PF08) && (func == SAI1_SCK_B_FUNC          )) ? 13 : \
	((gpio == PF08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF09) && (func == TIM20_BKIN_FUNC          )) ?  2 : \
	((gpio == PF09) && (func == TIM15_CH1_FUNC           )) ?  3 : \
	((gpio == PF09) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PF09) && (func == TIM5_CH4_FUNC            )) ?  6 : \
	((gpio == PF09) && (func == QUADSPI1_BK1_IO1_FUNC    )) ? 10 : \
	((gpio == PF09) && (func == FMC_A25_FUNC             )) ? 12 : \
	((gpio == PF09) && (func == SAI1_FS_B_FUNC           )) ? 13 : \
	((gpio == PF09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF10) && (func == TIM20_BKIN2_FUNC         )) ?  2 : \
	((gpio == PF10) && (func == TIM15_CH2_FUNC           )) ?  3 : \
	((gpio == PF10) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PF10) && (func == QUADSPI1_CLK_FUNC        )) ? 10 : \
	((gpio == PF10) && (func == FMC_A0_FUNC              )) ? 12 : \
	((gpio == PF10) && (func == SAI1_D3_FUNC             )) ? 13 : \
	((gpio == PF10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF11) && (func == TIM20_ETR_FUNC           )) ?  2 : \
	((gpio == PF11) && (func == FMC_NE4_FUNC             )) ? 12 : \
	((gpio == PF11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF12) && (func == TIM20_CH1_FUNC           )) ?  2 : \
	((gpio == PF12) && (func == FMC_A6_FUNC              )) ? 12 : \
	((gpio == PF12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF13) && (func == TIM20_CH2_FUNC           )) ?  2 : \
	((gpio == PF13) && (func == I2C4_SMBA_FUNC           )) ?  4 : \
	((gpio == PF13) && (func == FMC_A7_FUNC              )) ? 12 : \
	((gpio == PF13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF14) && (func == TIM20_CH3_FUNC           )) ?  2 : \
	((gpio == PF14) && (func == I2C4_SCL_FUNC            )) ?  4 : \
	((gpio == PF14) && (func == FMC_A8_FUNC              )) ? 12 : \
	((gpio == PF14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF15) && (func == TIM20_CH4_FUNC           )) ?  2 : \
	((gpio == PF15) && (func == I2C4_SDA_FUNC            )) ?  4 : \
	((gpio == PF15) && (func == FMC_A9_FUNC              )) ? 12 : \
	((gpio == PF15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG00) && (func == TIM20_CH1N_FUNC          )) ?  2 : \
	((gpio == PG00) && (func == FMC_A10_FUNC             )) ? 12 : \
	((gpio == PG00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG01) && (func == TIM20_CH2N_FUNC          )) ?  2 : \
	((gpio == PG01) && (func == FMC_A11_FUNC             )) ? 12 : \
	((gpio == PG01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG02) && (func == TIM20_CH3N_FUNC          )) ?  2 : \
	((gpio == PG02) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PG02) && (func == FMC_A12_FUNC             )) ? 12 : \
	((gpio == PG02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG03) && (func == TIM20_BKIN_FUNC          )) ?  2 : \
	((gpio == PG03) && (func == I2C4_SCL_FUNC            )) ?  4 : \
	((gpio == PG03) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PG03) && (func == TIM20_CH4N_FUNC          )) ?  6 : \
	((gpio == PG03) && (func == FMC_A13_FUNC             )) ? 12 : \
	((gpio == PG03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG04) && (func == TIM20_BKIN2_FUNC         )) ?  2 : \
	((gpio == PG04) && (func == I2C4_SDA_FUNC            )) ?  4 : \
	((gpio == PG04) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PG04) && (func == FMC_A14_FUNC             )) ? 12 : \
	((gpio == PG04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG05) && (func == TIM20_ETR_FUNC           )) ?  2 : \
	((gpio == PG05) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PG05) && (func == LPUART1_CTS_FUNC         )) ?  8 : \
	((gpio == PG05) && (func == FMC_A15_FUNC             )) ? 12 : \
	((gpio == PG05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG06) && (func == TIM20_BKIN_FUNC          )) ?  2 : \
	((gpio == PG06) && (func == I2C3_SMBA_FUNC           )) ?  4 : \
	((gpio == PG06) && (func == LPUART1_DE_FUNC          )) ?  8 : \
	((gpio == PG06) && (func == LPUART1_RTS_FUNC         )) ?  8 : \
	((gpio == PG06) && (func == FMC_INT_FUNC             )) ? 12 : \
	((gpio == PG06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG07) && (func == SAI1_CK1_FUNC            )) ?  3 : \
	((gpio == PG07) && (func == I2C3_SCL_FUNC            )) ?  4 : \
