UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32g47x_pinmux.h
	((gpio == PG07) && (func == LPUART1_TX_FUNC          )) ?  8 : \
	((gpio == PG07) && (func == FMC_INT_FUNC             )) ? 12 : \
	((gpio == PG07) && (func == SAI1_MCLK_A_FUNC         )) ? 13 : \
	((gpio == PG07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG08) && (func == I2C3_SDA_FUNC            )) ?  4 : \
	((gpio == PG08) && (func == LPUART1_RX_FUNC          )) ?  8 : \
	((gpio == PG08) && (func == FMC_NE3_FUNC             )) ? 12 : \
	((gpio == PG08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG09) && (func == SPI3_SCK_FUNC            )) ?  6 : \
	((gpio == PG09) && (func == USART1_TX_FUNC           )) ?  7 : \
	((gpio == PG09) && (func == FMC_NCE_FUNC             )) ? 12 : \
	((gpio == PG09) && (func == FMC_NE2_FUNC             )) ? 12 : \
	((gpio == PG09) && (func == TIM15_CH1N_FUNC          )) ? 14 : \
	((gpio == PG09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG10) && (func == RCC_MCO_FUNC             )) ?  0 : \
	((gpio == PG10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	AF_NO_SUCH_PINFUNC)

# define TIMERMUX(gpio, timer_nr, channel_nr) ((gpio == PIN_NONE) ? AF_PIN_NONE : 	\
	((gpio == PA00) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA00) && (timer_nr ==  5) && (channel_nr ==  1)) ?  2 : \
	((gpio == PA01) && (timer_nr ==  2) && (channel_nr ==  2)) ?  1 : \
	((gpio == PA01) && (timer_nr ==  5) && (channel_nr ==  2)) ?  2 : \
	((gpio == PA01) && (timer_nr == 15) && (channel_nr == -1)) ?  9 : \
	((gpio == PA02) && (timer_nr ==  2) && (channel_nr ==  3)) ?  1 : \
	((gpio == PA02) && (timer_nr ==  5) && (channel_nr ==  3)) ?  2 : \
	((gpio == PA02) && (timer_nr == 15) && (channel_nr ==  1)) ?  9 : \
	((gpio == PA03) && (timer_nr ==  2) && (channel_nr ==  4)) ?  1 : \
	((gpio == PA03) && (timer_nr ==  5) && (channel_nr ==  4)) ?  2 : \
	((gpio == PA03) && (timer_nr == 15) && (channel_nr ==  2)) ?  9 : \
	((gpio == PA04) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PA05) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA06) && (timer_nr == 16) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA06) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PA07) && (timer_nr == 17) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA07) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PA07) && (timer_nr ==  8) && (channel_nr == -1)) ?  4 : \
	((gpio == PA07) && (timer_nr ==  1) && (channel_nr == -1)) ?  6 : \
	((gpio == PA08) && (timer_nr ==  1) && (channel_nr ==  1)) ?  6 : \
	((gpio == PA09) && (timer_nr ==  1) && (channel_nr ==  2)) ?  6 : \
	((gpio == PA09) && (timer_nr ==  2) && (channel_nr ==  3)) ? 10 : \
	((gpio == PA10) && (timer_nr ==  1) && (channel_nr ==  3)) ?  6 : \
	((gpio == PA10) && (timer_nr ==  2) && (channel_nr ==  4)) ? 10 : \
	((gpio == PA11) && (timer_nr ==  1) && (channel_nr == -1)) ?  6 : \
	((gpio == PA11) && (timer_nr ==  4) && (channel_nr ==  1)) ? 10 : \
	((gpio == PA11) && (timer_nr ==  1) && (channel_nr ==  4)) ? 11 : \
	((gpio == PA12) && (timer_nr == 16) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA12) && (timer_nr ==  1) && (channel_nr == -2)) ?  6 : \
	((gpio == PA12) && (timer_nr ==  4) && (channel_nr ==  2)) ? 10 : \
	((gpio == PA13) && (timer_nr == 16) && (channel_nr == -1)) ?  1 : \
	((gpio == PA13) && (timer_nr ==  4) && (channel_nr ==  3)) ? 10 : \
	((gpio == PA14) && (timer_nr ==  8) && (channel_nr ==  2)) ?  5 : \
	((gpio == PA15) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA15) && (timer_nr ==  8) && (channel_nr ==  1)) ?  2 : \
	((gpio == PB00) && (timer_nr ==  3) && (channel_nr ==  3)) ?  2 : \
	((gpio == PB00) && (timer_nr ==  8) && (channel_nr == -2)) ?  4 : \
	((gpio == PB00) && (timer_nr ==  1) && (channel_nr == -2)) ?  6 : \
	((gpio == PB01) && (timer_nr ==  3) && (channel_nr ==  4)) ?  2 : \
	((gpio == PB01) && (timer_nr ==  8) && (channel_nr == -3)) ?  4 : \
	((gpio == PB01) && (timer_nr ==  1) && (channel_nr == -3)) ?  6 : \
	((gpio == PB02) && (timer_nr ==  5) && (channel_nr ==  1)) ?  2 : \
	((gpio == PB02) && (timer_nr == 20) && (channel_nr ==  1)) ?  3 : \
	((gpio == PB03) && (timer_nr ==  2) && (channel_nr ==  2)) ?  1 : \
	((gpio == PB03) && (timer_nr ==  8) && (channel_nr == -1)) ?  4 : \
	((gpio == PB04) && (timer_nr == 16) && (channel_nr ==  1)) ?  1 : \
	((gpio == PB04) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PB04) && (timer_nr ==  8) && (channel_nr == -2)) ?  4 : \
	((gpio == PB05) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PB05) && (timer_nr ==  8) && (channel_nr == -3)) ?  3 : \
	((gpio == PB05) && (timer_nr == 17) && (channel_nr ==  1)) ? 10 : \
	((gpio == PB06) && (timer_nr == 16) && (channel_nr == -1)) ?  1 : \
	((gpio == PB06) && (timer_nr ==  4) && (channel_nr ==  1)) ?  2 : \
	((gpio == PB06) && (timer_nr ==  8) && (channel_nr ==  1)) ?  5 : \
	((gpio == PB07) && (timer_nr == 17) && (channel_nr == -1)) ?  1 : \
	((gpio == PB07) && (timer_nr ==  4) && (channel_nr ==  2)) ?  2 : \
	((gpio == PB07) && (timer_nr ==  3) && (channel_nr ==  4)) ? 10 : \
	((gpio == PB08) && (timer_nr == 16) && (channel_nr ==  1)) ?  1 : \
	((gpio == PB08) && (timer_nr ==  4) && (channel_nr ==  3)) ?  2 : \
	((gpio == PB08) && (timer_nr ==  8) && (channel_nr ==  2)) ? 10 : \
	((gpio == PB09) && (timer_nr == 17) && (channel_nr ==  1)) ?  1 : \
	((gpio == PB09) && (timer_nr ==  4) && (channel_nr ==  4)) ?  2 : \
	((gpio == PB09) && (timer_nr ==  8) && (channel_nr ==  3)) ? 10 : \
	((gpio == PB09) && (timer_nr ==  1) && (channel_nr == -3)) ? 12 : \
	((gpio == PB10) && (timer_nr ==  2) && (channel_nr ==  3)) ?  1 : \
	((gpio == PB11) && (timer_nr ==  2) && (channel_nr ==  4)) ?  1 : \
	((gpio == PB13) && (timer_nr ==  1) && (channel_nr == -1)) ?  6 : \
	((gpio == PB14) && (timer_nr == 15) && (channel_nr ==  1)) ?  1 : \
	((gpio == PB14) && (timer_nr ==  1) && (channel_nr == -2)) ?  6 : \
	((gpio == PB15) && (timer_nr == 15) && (channel_nr ==  2)) ?  1 : \
	((gpio == PB15) && (timer_nr == 15) && (channel_nr == -1)) ?  2 : \
	((gpio == PB15) && (timer_nr ==  1) && (channel_nr == -3)) ?  4 : \
	((gpio == PC00) && (timer_nr ==  1) && (channel_nr ==  1)) ?  2 : \
	((gpio == PC01) && (timer_nr ==  1) && (channel_nr ==  2)) ?  2 : \
	((gpio == PC02) && (timer_nr ==  1) && (channel_nr ==  3)) ?  2 : \
	((gpio == PC02) && (timer_nr == 20) && (channel_nr ==  2)) ?  6 : \
	((gpio == PC03) && (timer_nr ==  1) && (channel_nr ==  4)) ?  2 : \
	((gpio == PC05) && (timer_nr ==  1) && (channel_nr == -4)) ?  6 : \
	((gpio == PC06) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PC06) && (timer_nr ==  8) && (channel_nr ==  1)) ?  4 : \
	((gpio == PC07) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PC07) && (timer_nr ==  8) && (channel_nr ==  2)) ?  4 : \
	((gpio == PC08) && (timer_nr ==  3) && (channel_nr ==  3)) ?  2 : \
	((gpio == PC08) && (timer_nr ==  8) && (channel_nr ==  3)) ?  4 : \
	((gpio == PC08) && (timer_nr == 20) && (channel_nr ==  3)) ?  6 : \
	((gpio == PC09) && (timer_nr ==  3) && (channel_nr ==  4)) ?  2 : \
	((gpio == PC09) && (timer_nr ==  8) && (channel_nr ==  4)) ?  4 : \
	((gpio == PC10) && (timer_nr ==  8) && (channel_nr == -1)) ?  4 : \
	((gpio == PC11) && (timer_nr ==  8) && (channel_nr == -2)) ?  4 : \
	((gpio == PC12) && (timer_nr ==  5) && (channel_nr ==  2)) ?  1 : \
	((gpio == PC12) && (timer_nr ==  8) && (channel_nr == -3)) ?  4 : \
	((gpio == PC13) && (timer_nr ==  1) && (channel_nr == -1)) ?  4 : \
	((gpio == PC13) && (timer_nr ==  8) && (channel_nr == -4)) ?  6 : \
	((gpio == PD00) && (timer_nr ==  8) && (channel_nr == -4)) ?  6 : \
	((gpio == PD01) && (timer_nr ==  8) && (channel_nr ==  4)) ?  4 : \
	((gpio == PD03) && (timer_nr ==  2) && (channel_nr ==  1)) ?  2 : \
	((gpio == PD04) && (timer_nr ==  2) && (channel_nr ==  2)) ?  2 : \
	((gpio == PD06) && (timer_nr ==  2) && (channel_nr ==  4)) ?  2 : \
	((gpio == PD07) && (timer_nr ==  2) && (channel_nr ==  3)) ?  2 : \
	((gpio == PD12) && (timer_nr ==  4) && (channel_nr ==  1)) ?  2 : \
	((gpio == PD13) && (timer_nr ==  4) && (channel_nr ==  2)) ?  2 : \
	((gpio == PD14) && (timer_nr ==  4) && (channel_nr ==  3)) ?  2 : \
	((gpio == PD15) && (timer_nr ==  4) && (channel_nr ==  4)) ?  2 : \
	((gpio == PE00) && (timer_nr == 20) && (channel_nr == -4)) ?  3 : \
	((gpio == PE00) && (timer_nr == 16) && (channel_nr ==  1)) ?  4 : \
	((gpio == PE01) && (timer_nr == 17) && (channel_nr ==  1)) ?  4 : \
	((gpio == PE01) && (timer_nr == 20) && (channel_nr ==  4)) ?  6 : \
	((gpio == PE02) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PE02) && (timer_nr == 20) && (channel_nr ==  1)) ?  6 : \
	((gpio == PE03) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PE03) && (timer_nr == 20) && (channel_nr ==  2)) ?  6 : \
	((gpio == PE04) && (timer_nr ==  3) && (channel_nr ==  3)) ?  2 : \
	((gpio == PE04) && (timer_nr == 20) && (channel_nr == -1)) ?  6 : \
	((gpio == PE05) && (timer_nr ==  3) && (channel_nr ==  4)) ?  2 : \
	((gpio == PE05) && (timer_nr == 20) && (channel_nr == -2)) ?  6 : \
	((gpio == PE06) && (timer_nr == 20) && (channel_nr == -3)) ?  6 : \
	((gpio == PE08) && (timer_nr ==  5) && (channel_nr ==  3)) ?  1 : \
	((gpio == PE08) && (timer_nr ==  1) && (channel_nr == -1)) ?  2 : \
	((gpio == PE09) && (timer_nr ==  5) && (channel_nr ==  4)) ?  1 : \
	((gpio == PE09) && (timer_nr ==  1) && (channel_nr ==  1)) ?  2 : \
	((gpio == PE10) && (timer_nr ==  1) && (channel_nr == -2)) ?  2 : \
	((gpio == PE11) && (timer_nr ==  1) && (channel_nr ==  2)) ?  2 : \
	((gpio == PE12) && (timer_nr ==  1) && (channel_nr == -3)) ?  2 : \
	((gpio == PE13) && (timer_nr ==  1) && (channel_nr ==  3)) ?  2 : \
	((gpio == PE14) && (timer_nr ==  1) && (channel_nr ==  4)) ?  2 : \
	((gpio == PE15) && (timer_nr ==  1) && (channel_nr == -4)) ?  6 : \
	((gpio == PF00) && (timer_nr ==  1) && (channel_nr == -3)) ?  6 : \
	((gpio == PF02) && (timer_nr == 20) && (channel_nr ==  3)) ?  2 : \
	((gpio == PF03) && (timer_nr == 20) && (channel_nr ==  4)) ?  2 : \
	((gpio == PF04) && (timer_nr == 20) && (channel_nr == -1)) ?  3 : \
	((gpio == PF05) && (timer_nr == 20) && (channel_nr == -2)) ?  2 : \
	((gpio == PF06) && (timer_nr ==  4) && (channel_nr ==  4)) ?  2 : \
	((gpio == PF06) && (timer_nr ==  5) && (channel_nr ==  1)) ?  6 : \
	((gpio == PF07) && (timer_nr ==  5) && (channel_nr ==  2)) ?  6 : \
	((gpio == PF08) && (timer_nr ==  5) && (channel_nr ==  3)) ?  6 : \
	((gpio == PF09) && (timer_nr == 15) && (channel_nr ==  1)) ?  3 : \
	((gpio == PF09) && (timer_nr ==  5) && (channel_nr ==  4)) ?  6 : \
	((gpio == PF10) && (timer_nr == 15) && (channel_nr ==  2)) ?  3 : \
	((gpio == PF12) && (timer_nr == 20) && (channel_nr ==  1)) ?  2 : \
	((gpio == PF13) && (timer_nr == 20) && (channel_nr ==  2)) ?  2 : \
	((gpio == PF14) && (timer_nr == 20) && (channel_nr ==  3)) ?  2 : \
	((gpio == PF15) && (timer_nr == 20) && (channel_nr ==  4)) ?  2 : \
	((gpio == PG00) && (timer_nr == 20) && (channel_nr == -1)) ?  2 : \
	((gpio == PG01) && (timer_nr == 20) && (channel_nr == -2)) ?  2 : \
	((gpio == PG02) && (timer_nr == 20) && (channel_nr == -3)) ?  2 : \
	((gpio == PG03) && (timer_nr == 20) && (channel_nr == -4)) ?  6 : \
	((gpio == PG09) && (timer_nr == 15) && (channel_nr == -1)) ? 14 : \
	AF_NO_SUCH_PINFUNC)
#endif
